#Assignment 03-01
import math

Px = int(input("Введите координаты точки х Px"))
Py = int(input ("Введите координаты точки y Py"))
Cx = int(input ("Введите координаты центра круга r1"))
Cy = int(input("Введите координаты центра круга r2"))
r1 = int(input ("Введит радиус внутреннего круга"))
r2 = int(input("Введит радиус внешнего круга"))

L = math.sqrt((Px-Cx)^2 + (Py-Cy)^2)

if r1 < L < r2:
    print(f" Точка ({Px, Py}) належить кільцю за центром у точці ({Cx, Cy}), та R1 = {r1}, R2 = {r2}" )
else:
    print(f" Точка ({Px, Py}) не належить кільцю за центром у точці ({Cx, Cy}), та R1 = {r1}, R2 = {r2}" )